In [253]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
from numpy import array
from numpy import argmax
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

In [254]:
customers=pd.read_csv('/Users/lukebarrett/Desktop/STA/DS Club/supermarket_data/customers.csv')
orders=pd.read_csv('/Users/lukebarrett/Desktop/STA/DS Club/supermarket_data/orders.csv')
products=pd.read_csv('/Users/lukebarrett/Desktop/STA/DS Club/supermarket_data/products.csv')
sales=pd.read_csv('/Users/lukebarrett/Desktop/STA/DS Club/supermarket_data/sales.csv')

In [255]:
#there are no null values in customers data set
customers_null = customers[customers.isna().any(axis=1)]
customers_null

Empty DataFrame
Columns: [customer_id, customer_name, gender, age, home_address, zip_code, city, state, country]
Index: []

In [256]:
#there are no null values in sales data set
sales_null = sales[sales.isna().any(axis=1)]
sales_null

Empty DataFrame
Columns: [sales_id, order_id, product_id, price_per_unit, quantity, total_price]
Index: []

In [257]:
#there are no null values in orders data set
orders_null = orders[orders.isna().any(axis=1)]
orders_null

Empty DataFrame
Columns: [order_id, customer_id, payment, order_date, delivery_date]
Index: []

In [258]:
#there are no null values in products data set
products_null = products[products.isna().any(axis=1)]
products_null

Empty DataFrame
Columns: [product_ID, product_type, product_name, size, colour, price, quantity, description]
Index: []

In [259]:
#still need to check for multicolinearity
#unique values in colour
products['colour'].unique()

#integer encoding colour
size_array = array(products['colour'])
label_encoder = LabelEncoder()
size = label_encoder.fit_transform(size_array)

#converting integer to onehot
onehot_encoder = OneHotEncoder(sparse=False)
label_encoded = size.reshape(len(size), 1)
onehot_encoded = onehot_encoder.fit_transform(label_encoded)

In [260]:
#adding onehot encoded column colour to products
products['onehot_colour'] = onehot_encoded.tolist()

In [261]:
#removing original size column
products = products.drop(columns = ['colour'])

In [262]:
products.head()

,product_ID,product_type,product_name,size,price,quantity,description,onehot_colour
0,0,Shirt,Oxford Cloth,XS,114,66,"A red coloured, XS sized, Oxford Cloth Shirt","[0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0]"
1,1,Shirt,Oxford Cloth,S,114,53,"A red coloured, S sized, Oxford Cloth Shirt","[0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0]"
2,2,Shirt,Oxford Cloth,M,114,54,"A red coloured, M sized, Oxford Cloth Shirt","[0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0]"
3,3,Shirt,Oxford Cloth,L,114,69,"A red coloured, L sized, Oxford Cloth Shirt","[0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0]"
4,4,Shirt,Oxford Cloth,XL,114,47,"A red coloured, XL sized, Oxford Cloth Shirt","[0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0]"

In [263]:
#still need to check for multicolinearity
#unique values in gender
customers['gender'].unique()

#integer encoding gender
size_array = array(customers['gender'])
label_encoder = LabelEncoder()
size = label_encoder.fit_transform(size_array)

#converting integer to onehot
onehot_encoder = OneHotEncoder(sparse=False)
label_encoded = size.reshape(len(size), 1)
onehot_encoded = onehot_encoder.fit_transform(label_encoded)

In [264]:
#adding onehot encoded column gender to customers
customers['onehot_gender'] = onehot_encoded.tolist()

In [265]:
#removing original gender column
customers = customers.drop(columns = ['gender'])

In [266]:
customers.head()

,customer_id,customer_name,age,home_address,zip_code,city,state,country,onehot_gender
0,1,Leanna Busson,30,8606 Victoria TerraceSuite 560,5464,Johnstonhaven,Northern Territory,Australia,"[0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0]"
1,2,Zabrina Harrowsmith,69,8327 Kirlin SummitApt. 461,8223,New Zacharyfort,South Australia,Australia,"[0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0]"
2,3,Shina Dullaghan,59,269 Gemma SummitSuite 109,5661,Aliburgh,Australian Capital Territory,Australia,"[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0]"
3,4,Hewet McVitie,67,743 Bailey GroveSuite 141,1729,South Justinhaven,Queensland,Australia,"[0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]"
4,5,Rubia Ashleigh,30,48 Hyatt ManorSuite 375,4032,Griffithsshire,Queensland,Australia,"[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0]"